### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd

data=[4,8,15,16,23,42]

series=pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:
mylist=[1,2,3,4,5,6,7,8,9,10]

series=pd.Series(mylist)
print(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data:

In [12]:
# Create a DataFrame
data1 = {'name': ['Alice', 'Bob', 'Claire'],
        'age': [25, 30, 27],
        'gender': ['F', 'M', 'F']}
df = pd.DataFrame(data1)
print(df)

     name  age gender
0   Alice   25      F
1     Bob   30      M
2  Claire   27      F

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans: In Pandas, a DataFrame is a two-dimensional table-like data structure that consists of rows and columns, where each column can have a different data type (e.g., integer, float, string, etc.). It is similar to a spreadsheet or a SQL table. The data in a DataFrame is organized in a way that allows for easy manipulation, analysis, and visualization.

On the other hand, a Pandas Series is a one-dimensional array-like data structure that represents a column of data in a DataFrame or a standalone data structure. It can contain data of any data type and has a unique index that identifies each element in the series.

In [2]:
## example of Dataframe

import pandas as pd

# Create a DataFrame
data = {'name': ['Alice', 'Bob', 'Charlie'],
        'age': [25, 30, 35],
        'gender': ['F', 'M', 'M']}
df = pd.DataFrame(data)

# Print the DataFrame
print(df)

      name  age gender
0    Alice   25      F
1      Bob   30      M
2  Charlie   35      M

In [3]:
## example of series
age_series = df['age']

# Print the Series
print(age_series)

0    25
1    30
2    35
Name: age, dtype: int64

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Pandas provides many built-in functions for manipulating data in a DataFrame. Here are some of the most common ones:

1.head(): returns the first n rows of the DataFrame

In [4]:
df.head() # returns the first 5 rows of the DataFrame df

      name  age gender
0    Alice   25      F
1      Bob   30      M
2  Charlie   35      M

2.tail(): returns the last n rows of the DataFrame

3.describe(): returns summary statistics of the DataFrame

4.sort_values(): sorts the DataFrame by one or more columns

5.groupby(): groups the DataFrame by one or more columns and applies an aggregation function to each group

6.drop(): removes rows or columns from the DataFrame

7.fillna(): fills missing values in the DataFrame with a specified value

In [11]:
df.tail() # returns the last 5 rows of the DataFrame df

      name  age gender
0    Alice   25      F
1      Bob   30      M
2  Charlie   35      M

In [6]:
df.describe() # returns summary statistics for the numeric columns of the DataFrame df

        age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [7]:
df.sort_values('age') # sorts the DataFrame df by the 'age' column in ascending order

      name  age gender
0    Alice   25      F
1      Bob   30      M
2  Charlie   35      M

In [8]:
df.groupby('gender').mean() # groups the DataFrame df by the 'gender' column and returns the mean value of each numeric column for each group

/tmp/ipykernel_77/984392582.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('gender').mean() # groups the DataFrame df by the 'gender' column and returns the mean value of each numeric column for each group

         age
gender
F       25.0
M       32.5

In [9]:
df.drop('gender', axis=1) # removes the 'gender' column from the DataFrame df

      name  age
0    Alice   25
1      Bob   30
2  Charlie   35

In [10]:
df.fillna(0) # replaces all missing values in the DataFrame df with 0

      name  age gender
0    Alice   25      F
1      Bob   30      M
2  Charlie   35      M

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans: In Pandas, both Series and DataFrame are mutable objects, while Panel is not mutable.

This means that you can change the contents of a Series or DataFrame after it has been created, while any modifications to a Panel require creating a new object.

### Q7. Create a DataFrame using multiple Series. Explain with an example.